In [4]:
import numpy as np
import pandas as pd

回忆一下Pandas的运算特性。

1.索引自动对齐，虽然索引顺序不一致，但是可以自动对齐。

2.填充空的参数是fill_value=xxxx,例如：A.add(B,fill_value=xxx)

3.axis = 0，代表沿着行对列操作。

4.对pd进行运算后，还会保持住原来的索引

### Pandas对空的处理

1.None是一个object，不是一个类型。  
2.Pandas中的空类型为Nan(not a number)，是Float类型。  
3.Pandas能自动将None转换为Nan  
4.删除空值方法，dropna()  
5.判断空值和非空方法isnull(),notnull()  
6.dropna()会将含有空值的行和列都会删掉。  
7.避免dropna()删掉全部空值，可指定删除行或列，方法为dropna(axis='columns') |||| dropna(axis = 'rows')，注意此处都是复数。  
8.另外也可以删除符合条件的行或列，方法也是dropna()，但是要带另外一个参数，how='xxxx'.  
&emsp;&emsp;删除带空值的行：dropna(axis = 'rows',how='any')  
&emsp;&emsp;删除全为空的列：dropna(axis = 'columns',how = 'all')  
9.可以通过非空的个数删除对应的行或列  
&emsp;&emsp;删除空值等于3的行：dropna(axis = 'rows',thresh = 3)  
10.填充空的方法是fillna().  
&emsp;&emsp;填充固定值11：fillna(11).  
&emsp;&emsp;根据前面值填充后面值：fillna(method='ffill') -- forward fill  
&emsp;&emsp;&emsp;&emsp;沿着行对列进行填充：fillna(axis='rows',method='ffill')  
&emsp;&emsp;根据后面值填充空值：fillna(method='bfill')  -- back fill  
&emsp;&emsp;&emsp;&emsp;沿着列对行进行填充：fillna(axis='columns',method='bfill')

In [6]:
# 生成一个pd

data = pd.Series([1,None,np.nan,'hello'])

In [7]:
data.dropna()

0        1
3    hello
dtype: object

In [8]:
data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
data.notnull()

0     True
1    False
2    False
3     True
dtype: bool

In [10]:
data.fillna(22)

0        1
1       22
2       22
3    hello
dtype: object

In [11]:
data

0        1
1     None
2      NaN
3    hello
dtype: object

In [31]:
df = pd.DataFrame([
    [1,np.nan,22],
    [3,None,11],
    [55,66,88]
])

In [32]:
df

    0     1   2
0   1   NaN  22
1   3   NaN  11
2  55  66.0  88

In [33]:
# 删除空,只要有空都会被删除
df.dropna()

    0     1   2
2  55  66.0  88

In [34]:
# 使用how参数,删除有空的列
df.dropna(how='any',axis='columns')

    0   2
0   1  22
1   3  11
2  55  88

In [35]:
# 删除全部为空的行
df.dropna(how='all',axis='rows')

    0     1   2
0   1   NaN  22
1   3   NaN  11
2  55  66.0  88

因为没有整行都是空的行，所以没有任何数据被删除。

In [36]:
df[3] = np.nan

In [37]:
df

    0     1   2   3
0   1   NaN  22 NaN
1   3   NaN  11 NaN
2  55  66.0  88 NaN

In [38]:
df.dropna(axis='columns',thresh=2)

    0   2
0   1  22
1   3  11
2  55  88

thresh参数代表大于和等于指定数据的对应行或列被删除

In [39]:
df

    0     1   2   3
0   1   NaN  22 NaN
1   3   NaN  11 NaN
2  55  66.0  88 NaN

In [40]:
df.fillna(100)

    0      1   2      3
0   1  100.0  22  100.0
1   3  100.0  11  100.0
2  55   66.0  88  100.0

In [60]:
df

    0     1   2   3
0   1   NaN  22 NaN
1   3   NaN  11 NaN
2  55  66.0  88 NaN

In [65]:
df[1][0] = 100

C:\Users\WangShangtao\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [66]:
df

    0      1   2   3
0   1  100.0  22 NaN
1   3    NaN  11 NaN
2  55   66.0  88 NaN

In [67]:
df[3][0]=200
df

C:\Users\WangShangtao\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    0      1   2      3
0   1  100.0  22  200.0
1   3    NaN  11    NaN
2  55   66.0  88    NaN

In [68]:
df.fillna(method='ffill',axis='rows')

    0      1   2      3
0   1  100.0  22  200.0
1   3  100.0  11  200.0
2  55   66.0  88  200.0

In [69]:
df

    0      1   2      3
0   1  100.0  22  200.0
1   3    NaN  11    NaN
2  55   66.0  88    NaN

In [70]:
df.fillna(method='bfill',axis='columns')

      0      1     2      3
0   1.0  100.0  22.0  200.0
1   3.0   11.0  11.0    NaN
2  55.0   66.0  88.0    NaN